# TextOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..TextOrientation Property
TableCellStyle Class See Also
---
The orientation of the cell (for vertical/horizontal text) with input in degrees multiplied by 10
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int TextOrientation { get; set; }
```

Visual Basic
---
```text
Public Property TextOrientation As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int TextOrientation {
	int get ();
	void set (int value);
}
```

# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace